# Игра "Эрудит"
# Нужно написать программу scrabble, которая помогает считать кол-во очков (points), полученное за слово (word)
# По одному очку вы получите за буквы а, в, е=ё, и, н, о, р, с, т.
# Два очка стоит д, к, л, м, п, у.
# Три балла получают за б, г, ь, а также я.
# Четыре балла стоят буквы й, ы.
# 5 очков засчитывается за ж, з, х, ц, ч.
# 6 и 7 очков не предусмотрено.
# Восемь можно получить за букву ф, ш, э, ю.
# 10 баллов стоит буква щ,
# а 15 - ъ
# Например (Ввод --> Вывод):
# курс --> 6 (к=2, у=2, р=1, с=1)


def scrabble(word):
    """
    Функция, которая помогает считать кол-во очков (points), полученное за слово (word)
    :param word:
    :return: количество очков (points)
    """
    # Здесь нужно написать код
    lst_worl = list(word)  # Переводим строку в список
    dict_points = {}  # Создаем пустой словарь
    points = 0  # Изначально баллы равны 0.
    # Создаем словари с нужными баллами для определенных букв
    point_1 = dict.fromkeys(['а', 'в', 'е', 'ё', 'и', 'н', 'о', 'р', 'с', 'т'], 1)
    point_2 = dict.fromkeys(['д', 'к', 'л', 'м', 'п', 'у'], 2)
    point_3 = dict.fromkeys(['б', 'г', 'ь', 'я'], 3)
    point_4 = dict.fromkeys(['й', 'ы'], 4)
    point_5 = dict.fromkeys(['ж', 'з', 'х', 'ц', 'ч'], 5)
    point_8 = dict.fromkeys(['ф', 'ш', 'э', 'ю'], 8)
    point_10 = dict.fromkeys(['щ'], 10)
    point_15 = dict.fromkeys(['ъ'], 15)
    # Объединяем все словари в один список для последующей итерации по нему
    all_points = [point_1, point_2, point_3, point_4, point_5, point_8, point_10, point_15]
    # Итерируемся по списку со словарями и создаем один общий
    for dct in all_points:
        dict_points.update(dct)
    # Для каждой буквы из заданного слова ищем такой же ключ в словаре
    # берем его значение и прибавляем к points = 0
    for letter in lst_worl:
        for point in dict_points.keys():
            if point == letter:
                points += dict_points[point]
    return points

# Ниже НИЧЕГО НЕ НАДО ИЗМЕНЯТЬ


data = ["курс", 'авеинорстё', 'дклмпеу', 'бгья', 'йы', 'жзхцч', 'фшэю', 'щъ', "карабасбарабас", "околоводопроводного",
        "еженедельное", 'эхоэнцефалограф', 'человеконенавистничество', 'делопроизводительница']

test_data = [6, 10, 13, 12, 8, 25, 32, 25, 21, 26, 20, 54, 34, 36]

for i, d in enumerate(data):
    assert scrabble(d) == test_data[i], f'С набором {d} есть ошибка, не проходит проверку'
    print(f'Тестовый набор {d} прошёл проверку')
print('Всё ок')
