# Задача со ЗВЁЗДОЧКОЙ. Решать НЕ обязательно.
# Программа получает на вход натуральное число num.
# Программа должна вывести другое натуральное число, удовлетворяющее условиям:
# Новое число должно отличаться от данного ровно одной цифрой
# Новое число должно столько же знаков как исходное
# Новое число должно делиться на 3
# Новое число должно быть максимально возможным из всех таких чисел
# Например (Ввод --> Вывод) :
#
# 379 --> 879
# 15 --> 75
# 4974 --> 7974

def max_division_by_3(num):
    # Здесь нужно написать код
    str_num = str(num)  # Преобразовываем число в строку
    list_num = list(str_num)  # Преобразовываем строку в список
    finish = []  # Создаем пустой список, куда будем помещать значения, подходящие под условия
    for idx, value in enumerate(list_num):
        list_num = list(str_num)  # Возвращаемся к исходному числу
        for x in range(int(value), 9 + 1):  # Для х от значения цифры до 9
            x = str(x)
            value = x
            list_num.pop(idx)  # Удаляем
            list_num.insert(idx, value)  # Вставляем на удаленной место новое значение
            num1 = ''.join(list_num)  # Преобразовываем список в строку
            if int(num1) % 3 == 0:  # Если итоговое значение делится на 3, то добавляем его в отдельный список
                finish.append(num1)
            else:
                continue
    new_num = int(max(finish))  # Присваиваем максимальное значение
    return new_num

# Ниже НИЧЕГО НЕ НАДО ИЗМЕНЯТЬ


data = [
    379, 810, 981, 4974, 996, 9000, 15, 0, 9881, 9984, 9876543210, 98795432109879543210
]

test_data = [
    879, 870, 987, 7974, 999, 9900, 75, 9, 9981, 9987, 9879543210, 98798432109879543210
]


for i, d in enumerate(data):
    assert max_division_by_3(d) == test_data[i], f'С набором {d} есть ошибка, не проходит проверку'
    print(f'Тестовый набор {d} прошёл проверку')
print('Всё ок')
