# Дан файл test_file/task_3.txt можно считать, что это запись покупок в магазине, где указана только цена товара
# В каждой строке файла записана цена товара.
# Покупки (т.е. несколько подряд идущих цен) разделены пустой строкой
# Нужно найти сумму трёх самых дорогих покупок, которые запишутся в переменную three_most_expensive_purchases

# Здесь пишем код
f = open('test_file/task_3.txt', encoding='utf-8')
list_row = f.readlines()  # Формируем списки строк, по которым будем итерироваться
lst = []  # Формируем пустой список
dict_row = {}  # Формируем пустой словарь, который будем обновлять в цикле
key = 0  # Ключи для нашего словаря
value = 0  # Значения для нашего словаря
try:
    # Итерируемся по спискам строк
    for line in list_row:
        line = line.replace("""\n""", '')
        # Проверяем, является ли наша строка пустой,
        # если да, то присваиваем новое значение для key и обнуляем value
        if line == '':
            key += 1
            value = 0
            line = 0
        # Увеличиваем значение на цену товара
        value += int(line)
        # Формируем пару ключ: значение
        new_dict = {key: value}
        # Обновляем наш итоговый словарь
        dict_row.update(new_dict)
    # В цикле записываем значения в пустой список
    for val in dict_row.values():
        lst.append(val)
    # Сортируем список
    lst_sort = sorted(lst)
    # Присваиваем переменной значение суммы 3 последних элементов
    three_most_expensive_purchases = lst_sort[-1] + lst_sort[-2] + lst_sort[-3]
finally:
    f.close()

assert three_most_expensive_purchases == 202346
